def interface():
    print("""
        ***СПРАВОЧНИК***
        """)
    print('Выберите одно из действий(введите цифру): ')
    print("""
        1 - Добавление контакта
        2 - Вывод всех
        3 - поиск по фамилиям
        4 - удалить контакт
        5 - изменить контакт
        6 - выход
    """)
def add_family():
    print("Введите ФИО и номер телефона(+375291001010) ")

def add_tel():
    print('Введите номер телефона (9 цифр) : ')

def exit():
    print("""
    Вы вышли из справочника!!!!
    """)
    print("**************************************************************************")

def search_contact():
    print("Введите фамилию для поиска :")

def list_contacts():
    print("""
    Список контактов
    """)


















